Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: # A helper to identify visitors
ja: helper whois => sub {

source: # Access request information
ja: # リクエストの情報にアクセス

source: # Access session data in action and template
ja: # アクションとテンプレートの中のセッションデータへのアクセス

source: # Admin section
ja: # Adminの部分

source: # Authenticate based on name parameter
ja: # nameパラメータを元にした認証

source: # Authenticated
ja: # 認証されなた

source: # Blocking
ja: # ブロッキング

source: # Check file size
ja: # ファイルサイズのチェック

source: # Check if we have a log directory that is writable
ja: # 書き込み可能なログディレクトリがあるかどうか調べる

source: # Concurrent non-blocking
ja: # 並列のノンブロッキング

source: # Default to moniker
ja: # monikerのデフォルト

source: # Disable detection and allow the following routes to re-enable it on demand
ja: # 検知を無効にして、以下のルートが再び選択的にできるようにする

source: # Echo the request body and send custom header with response
ja: # リクエストボディをエコーして、レスポンスのついたカスタムヘッダを送信

source: # Event loop
ja: # イベントループ

source: # Global logic shared by all routes
ja: # すべてのルートで共有されるグローバルなロジック

source: # HTML/XML DOM parser with CSS selectors
ja: # CSSセレクタ付きHTML/XML DOMパーサー

source: # HTTP/WebSocket server
ja: # HTTP/WebSocket サーバ

source: # HTTP/WebSocket user agent
ja: # HTTP/WebSocket ユーザエージェント

source: # Local logic shared only by routes in this group
ja: # このグループにおいてのルートによってだけ共有されるローカルなロジック

source: # Modify the received JSON document and return it
ja: # 受け取ったJSONドキュメントを変更して返す

source: # Multipart upload handler
ja: # Multipartのアップロードのハンドラ

source: # Non-blocking
ja: # ノンブロッキング

source: # Not authenticated
ja: # 認証されなかった

source: # Only reached when authenticated
ja: # / (with authentication)

source: # Perl-ish templates
ja: # Perl風テンプレート

source: # Prepare mode specific message during startup
ja: # startupの間にモードに特有のメッセージを準備する

source: # Process uploaded file
ja: # アップロードされたファイルを処理

source: # Reduced log output outside of development mode
ja: # 開発モード以外でログの出力を減らす

source: # Render template "templates/foo/bar.html.ep"
ja: # "templates/foo/bar.html.ep"というテンプレートを描画する

source: # Render the template "hello.html.ep"
ja: # "hello.html.ep"というテンプレートを描画

source: # Render the template "index.html.ep"
ja: # "index.html.ep"というテンプレートを描画

source: # Route leading to an action that renders a template
ja: # テンプレートを描画するアクションに至るルート

source: # Route leading to an action that renders some text
ja: # テキストをレンダリングするアクションへのルーティング

source: # Start the "daemon" command
ja: # "daemon"コマンドを開始する

source: # Upload form in DATA section
ja: # DATAセクションのformをアップロード

source: # Use helper in action and template
ja: # アクションとテンプレートのなかでヘルパーを使う

source: # Warn developers about insecure default
ja: # 安全でないデフォルトを開発者に警告する

source: $ ./myapp.pl daemon -l http://*:8080
ja: $ ./myapp.pl daemon --listen http://*:8080

source: $ ./myapp.pl get /
ja: =head2 Hello World!

source: $ mojo generate lite_app myapp.pl
ja: $ mojo generate lite_app

source: $c->app->log->debug("Request from $user");
ja: $self->app->log->debug("Request from $user.");

source: $c->app->log->debug('Rendering mode specific message');
ja: $self->app->log->debug('Rendering mode specific message.');

source: $c->on(json => sub {
ja: $self->on(json => sub {

source: $c->render(data => $c->req->body);
ja: $self->render(data => $self->req->body);

source: $c->render(json => $dom->find('h1, h2, h3')->map('text')->to_array);
ja: $self->render(json => [$dom->find('h1, h2, h3')->text->each]);

source: $c->render(template => 'denied');
ja: $self->render(template => 'denied');

source: $c->render(template => 'detected');
ja: $self->render(template => 'detected');

source: $c->render(template => 'foo/bar');
ja: # templates/foo/bar.html.ep

source: $c->render(template => 'groovy', format => 'txt');
ja: $self->render(template => 'groovy', format => 'txt');

source: $c->render(text => "Hello $user.");
ja: $self->render(text => "Hello $user!");

source: $c->render(text => "Our :bar placeholder matched $bar");
ja: $self->render(text => "Our :bar placeholder matched $bar");

source: $c->render(text => "Our :foo placeholder matched $foo");
ja: $self->render(text => "Our :foo placeholder matched $foo");

source: $c->render(text => "Request by $ua reached $host.");
ja: $self->render(text => "Request by $ua reached $host.");

source: $c->render(text => "Thanks for uploading $size byte file $name.");
ja: $self->render(text => "Thanks for uploading $size byte file $name.");

source: $c->render(text => "You called /whatever with $method.");
ja: $self->render(text => "You called /whatever with $method.");

source: $c->render(text => "You uploaded $size bytes to /hello.");
ja: $self->render(text => "You uploaded $size bytes to /hello.");

source: $c->render(text => "You're not Bender.");
ja: $self->render(text => "You're not Bender.");

source: $c->render(text => "You're not awesome enough.");
ja: $self->render(text => "You're not awesome enough.");

source: $c->render(text => $msg);
ja: $self->render(text => $msg);

source: $c->render(text => 'Bye World!');
ja: $self->render(text => 'Bye World!');

source: $c->render(text => 'Congratulations, you are using a cool browser.');
ja: $self->render(text => 'Congratulations, you are using a cool browser.');

source: $c->render(text => 'Dude, you really need to upgrade to Firefox.');
ja: $self->render(text => 'Dude, you really need to upgrade to Firefox.');

source: $c->render(text => 'Hello Mojolicious.');
ja: $self->render(text => 'Hello Mojolicious.');

source: $c->render(text => 'Hello World!');
ja: $self->render(text => 'Hello World!');

source: $c->render(text => 'hello world');
ja: $self->render(text => 'hello world');

source: $c->render;
ja: $self->render;

source: $c->res->headers->header('X-Bender' => 'Bite my shiny metal ass!');
ja: $self->res->headers->header('X-Bender' => 'Bite my shiny metal ass!');

source: $c->respond_to(
ja: $self->respond_to(

source: $c->send({json => $hash});
ja: $self->send({json => $hash});

source: $c->session->{counter}++;
ja: $self->session->{counter}++;

source: ...List of available commands (or automatically detected environment)...
ja: ...利用可能なコマンドが表示(あるいは自動的に環境が検知される)...

source: =head1 DESCRIPTION
ja: =head1 説明

source: =head1 NAME
ja: =head1 名前

source: =head1 SEE ALSO
ja: =head1 参考

source: =head1 SYNOPSIS
ja: =head1 使い方

source: =head1 TUTORIAL
ja: =head1 チュートリアル

source: =head2 Blocks
ja: =head2 ブロック

source: =head2 Built-in C<exception> and C<not_found> pages
ja: =head2 組み込みの例外(C<exception>)とノットファウンド(C<not_found>)ページ

source: =head2 Commands
ja: =head2 コマンド

source: =head2 Conditions
ja: =head2 条件

source: =head2 Content negotiation
ja: =head2 コンテントネゴシエーション

source: =head2 External templates
ja: =head2 外部テンプレート

source: =head2 File uploads
ja: =head2 ファイルアップロード

source: =head2 Formats
ja: =head2 フォーマット

source: =head2 GET/POST parameters
ja: =head2 GET/POSTパラメーター

source: =head2 HTTP methods
ja: =head2 HTTPメソッド

source: =head2 Helpers
ja: =head2 ヘルパー

source: =head2 Layouts
ja: =head2 レイアウト

source: =head2 Mode
ja: =head2 モード

source: =head2 Optional placeholders
ja: =head2 オプショナルなプレースホルダー

source: =head2 Placeholders
ja: =head2 プレースホルダー

source: =head2 Relaxed Placeholders
ja: =head2 リラックスプレースホルダー

source: =head2 Reloading
ja: =head2 リロード

source: =head2 Restrictive placeholders
ja: =head2 制約的なプレースホルダー

source: =head2 Route names
ja: =head2 ルーティング名

source: =head2 Routes
ja: =head2 ルーティング(Routes)

source: =head2 Sessions
ja: =head2 セッション

source: =head2 Stash and templates
ja: =head2 スタッシュとテンプレート

source: =head2 Static files
ja: =head2 静的ファイル

source: =head2 Testing
ja: アプリケーションのテストをするのはとても簡単です。

source: =head2 Under
ja: =head2 アンダー(Under)

source: =head2 User agent
ja: =head2 ユーザーエージェント

source: =head2 Wildcard placeholders
ja: =head2 ワイルドカードプレースホルダー

source: A call to L<Mojolicious/"start"> (C<app-E<gt>start>), which starts the command system, should be the last expression in your application, because its return value can be significant.
ja: L<Mojolicious/"start"> (C<app-E<gt>start>)コールによってコマンドシステムが開始します。これはアプリケーションの最後の処理になります。返り値が重要になるからです。

source: A few stash values like C<template>, C<text> and C<data> are reserved and will be used by L<Mojolicious::Controller/"render"> to decide how a response should be generated.
ja: テンプレートはC<DATA>セクションに埋め込むことができます。C<template>、C<text>、C<data>のようなものがいくつかスタッシュの値として予約されており、レスポンスがどのように生成されるかを決定するために、 [[Mojolicious::Controller]]のC<render>によって利用されます。

source: A mode other than C<development> will raise the log level from C<debug> to C<info>.
ja: C<development>モード以外のモードでは、C<debug>からC<info>のログレベルにあがります。

source: A powerful web development toolkit, with all the basic tools and helpers needed to write simple web applications and higher level web frameworks, such as L<Mojolicious>.
ja: シンプルなWebアプリケーションやL<Mojolicious> などの高レベルのWebフレームワークを書くために必要なすべての基本的なツールとヘルパーを備えた強力なWeb開発ツールキット。

source: A quick example-driven introduction to the wonders of L<Mojolicious::Lite>.
ja: [[Mojolicious::Lite]]がどのようなものかを紹介するためのすばやいサンプルです。

source: A simple Hello World application can look like this, L<strict>, L<warnings>, L and Perl 5.10 L<features|feature> are automatically enabled and a few L<functions|Mojolicious::Lite/"FUNCTIONS"> imported, when you use L<Mojolicious::Lite>, turning your script into a full featured web application.
ja: かんたんなHello Worldアプリケーションはこのようになります。L<strict>, L<warnings>, L 、Perl 5.10 L<features|feature> の機能は自動的に有効になり、 L<functions|Mojolicious::Lite/"FUNCTIONS"> がいくつかインポートされます。 L<Mojolicious::Lite>を使うときにあなたのスクリプトを完全な機能を備えたウェブアプリケーションに変えます。

source: All C<GET> and C<POST> parameters sent with the request are accessible via L<Mojolicious::Controller/"param">.
ja: すべてのC<GET>とC<POST>のパラメーターはC<param>を通してアクセスできます。

source: All following routes are only evaluated if the callback returned a true value.
ja: すべての続くルーティングはunderコールバックが真値を返したときだけ評価されます。

source: All messages will be written to C<STDERR> or a C<log/$mode.log> file if a C<log> directory exists.
ja: すべてのメッセージはC<STDERR>に出力されるか、 C<log>ディレクトリが存在している場合はC<log/$mode.log>に出力されます。

source: All placeholders get compiled to a regular expression internally, this process can also be customized.
ja: すべてのプレースホルダーは内部的には正規表現にコンパイルされます。この処理は簡単にカスタマイズすることができます。

source: All placeholders require a value, but by assigning them default values you can make capturing optional.
ja: すべてのプレースホルダーは値を必要としますが、 プレースホルダーにデフォルト値を設定することにより キャプチャをオプショナルなものにすることができます。

source: All routes can have a name associated with them, this allows automatic template detection and backreferencing with L<Mojolicious::Controller/"url_for">, on which many methods and helpers like L<Mojolicious::Plugin::TagHelpers/"link_to"> rely.
ja: すべてのルーティング(routes)は関連付けられた名前を持つことができます。名前を付けておけばテンプレートの自動的な検索や[[Mojolicious::Controller]]のC<url_for>による逆引きや[[Mojolicious::Plugin::TagHelpers]]のC<link_to>などの多くのヘルパーを使ったりすることができます。

source: Almost everything you'll learn here also applies to full L<Mojolicious> applications.
ja: ここで学んだことのほとんどすべて普通の[[Mojolicious]]アプリケーションに適用できるでしょう。

source: And don't worry about revealing too much information on these pages, they are only available during development, and will be replaced automatically with pages that don't reveal any sensitive information in a production environment.
ja: ページでたくさんの情報が明らかになるといっても心配しないでください。これは開発中にだけオンになります。プロダクション環境では、大切な情報を見せないページへと自動的に置き換わります。

source: Authentication and code shared between multiple routes can be realized easily with routes generated by L<Mojolicious::Lite/"under">.
ja: 認証や複数のルーティングの間でコードの共有はC<under>構文を使うことで簡単に実現できます。

source: Both have a higher precedence than routes for C<GET> and C<HEAD> requests.
ja: 両方ともC<GET>、C<HEAD>リクエストのルーティングよりも高い優先順位を持ちます。

source: CGI and L<PSGI> environments can even be detected and will usually just work without commands.
ja: CGIとL<PSGI> の環境は自動的に検知されるため、通常はコマンドなしで機能します。

source: Conditions such as C<agent> and C<host> from L<Mojolicious::Plugin::HeaderCondition> allow even more powerful route constructs.
ja: [[Mojolicious::Plugin::HeaderCondition]]からC<agent>やC<host>のような条件 を使用すればより強力なルーティングを構築することができます。

source: Content negotiation with C<Range>, C<If-None-Match> and C<If-Modified-Since> headers is supported as well and can be tested very easily with L<Mojolicious::Command::get>.
ja: C<Range>, C<If-None-Match>、C<If-Modified-Since>ヘッダー によるコンテンツネゴシエーションがサポートされ、 [[Mojolicious::Command::get]]で簡単に試験できます。

source: Default values that don't belong to a placeholder simply get merged into the stash all the time.
ja: プレースホルダーに所属しないデフォルト値は、 いつでも単純にスタッシュにマージされます。

source: During development you will encounter these pages whenever you make a mistake, they are gorgeous and contain a lot of valuable information that will aid you in debugging your application.
ja: 開発中、間違いを犯したときはいつでも、 このページに遭遇するでしょう。これは、すばらしく、アプリケーションのデバックに役立つ 情報が多く含まれています。

source: Especially in combination with L<Mojo::JSON> and L<Mojo::DOM> this can be a very powerful tool.
ja: 特に[[Mojo::JSON]]と[[Mojo::DOM]]の組み合わせはとても強力なツールです。

source: External static files are not limited to a single file extension and will be served automatically from a C<public> directory if it exists.
ja: 外部に配置された静的ファイルは単一の拡張子に制限されず、 C<public>ディレクトリが存在すれば自動的にサーブされます。

source: For more information about how to deploy your application see also L<Mojolicious::Guides::Cookbook/"DEPLOYMENT">.
ja: アプリケーションをどのようにデプロイするかの情報は、 [[Mojolicious::Guides::Cookbook]]のC<デプロイメント>の項目を見てください。

source: For more information about templates see also L<Mojolicious::Guides::Rendering/"Embedded Perl">.
ja: テンプレートのさらなる情報については [[Mojolicious::Guides::Rendering]]のC<埋め込みのPerl>の項目を見てください。

source: For more information about the user agent see also L<Mojolicious::Guides::Cookbook/"USER AGENT">.
ja: ユーザーエージェントについてのより多くの情報は[[Mojolicious::Guides::Cookbook]]のC<ユーザーエージェント>の項目にあります。

source: Formats can be automatically detected from file extensions like C<.html>, they are used to find the right template and generate the correct C<Content-Type> header.
ja: 「フォーマット(formats)」はファイルの拡張子を見ることによって自動的に検出されます。

source: I'll rest # easier not knowing where they are." 1;
ja: I'll rest # easier not knowing where they are." 1; https://www.tvfanatic.com/quotes/these-old-doomsday-devices-are-dangerously-unstable-ill-rest/

source: It is highly encouraged that readers continue on to the remaining guides after reading this one.
ja: これを読み終わった後は残りのガイドを読む進めるのを強くおすすめします。

source: JSON is the most commonly used data-interchange format for web services.
ja: JSONは、ウェブサービスでもっともよく使われるデータ送信フォーマットです。

source: Just be aware that all session data gets serialized with L<Mojo::JSON> and stored client-side, with a cryptographic signature to prevent tampering.
ja: すべてのセッションデータは[[Mojo::JSON]]でシリアライズされており、 クライアントサイドに保存されることを意識しておいてください。改ざんを防ぐために、暗号化された署名がついています。

source: Just make sure not to use C<^> and C<$>, or capturing groups C<(...)>, non-capturing groups C<(?:...)> are fine though.
ja: C<^>とC<$>を使ったりグループC<(...)>のキャプチャは行わないでください。けれどもC<(?:...)>は大丈夫。

source: Just receive messages by subscribing to events such as L<Mojo::Transaction::WebSocket/"json"> with L<Mojolicious::Controller/"on"> and return them with L<Mojolicious::Controller/"send">.
ja: [[Mojo::Transaction::WebSocket]]のC<json>と同じイベントを、[[Mojolicious::Controller]]のC<on>を使って購読することによってメッセージを受信することができます。[[Mojolicious::Controller]]のC<send>を使ってメッセージを返却することもできます。

source: L<Mojolicious::Controller/"req"> and L<Mojolicious::Controller/"res"> give you full access to all HTTP features and information.
ja: [[Mojolicious::Controller]]のC<req>と[[Mojolicious::Controller]]のC<res> を使って、HTTPの機能と情報のすべてに完全にアクセスすることができます。

source: L<Mojolicious> loves JSON and comes with the possibly fastest pure-Perl implementation L<Mojo::JSON> built right in, which is accessible through L<Mojo::Message/"json"> as well as the reserved stash value C<json>.
ja: L<Mojolicious>はJSONが大好きです。ピュアPerlではおそらく最高速の実装であるL<Mojo::JSON> が組み込まれており、L<Mojo::Message/"json"> や予約済みスタッシュ値のC<json>を使ってアクセスできます。

source: MIME type mappings can be extended or changed easily with L<Mojolicious/"types">.
ja: MIMEタイプのマッピンは、[[Mojolicious]]のC<types>によって、拡張したり、変更したりすることができます。

source: Many different L<commands|Mojolicious::Commands/"COMMANDS"> are automatically available from the command line.
ja: たくさんのL<commands|Mojolicious::Commands/"COMMANDS"> が自動的にコマンドラインで利用できるようになります。

source: Mojo - Web development toolkit
ja: Mojo - Web開発ツールキット

source: Mojolicious::Guides::Tutorial - Get started with Mojolicious
ja: Mojolicious::Guides::Tutorial - Mojoliciousをはじめよう

source: Nameless routes get an automatically generated one assigned that is simply equal to the route itself without non-word characters.
ja: 名前のないルートが、自動的に生成されます。この名前は、ルート自身の名前から、ノンワード文字を取り除いたもの と等しくなります。

source: Or you can just disable format detection with a special type of restrictive placeholder.
ja: フォーマットの検知を無効にすることもできます。

source: Other guides delve deeper into topics like L<growing|Mojolicious::Guides::Growing> a L<Mojolicious::Lite> prototype into a well-structured L<Mojolicious> application, L<routing|Mojolicious::Guides::Routing>, L<rendering|Mojolicious::Guides::Rendering> and more.
ja: その他のガイドでは、L<growing|Mojolicious::Guides::Growing>のようにL<Mojolicious::Lite>のプロトタイプをよく構築されたL<Mojolicious> アプリケーションに成長させるものだったり、 L<routing|Mojolicious::Guides::Routing>、 L<rendering|Mojolicious::Guides::Rendering>、その他さまざまなものがあります。

source: Prefixing multiple routes is another good use for it.
ja: プレフィックスをつけた複数のルーティングはC<under>のよい利用方法です。

source: Relaxed placeholders allow matching of everything until a C</> occurs, similar to the regular expression C<([^/]+)>.
ja: リラックスプレースホルダーを使えば、 C</>が出現するまでのすべてにマッチさせることができます。

source: Response content is often generated by actions with L<Mojolicious::Controller/"render">, but more about that later.
ja: レスポンスコンテントの多くは L<Mojolicious::Controller/"render">で生成されます。詳しくは後ほどにて。

source: Results are accessible via L<Mojolicious::Controller/"stash"> and L<Mojolicious::Controller/"param">.
ja: 結果は[[Mojolicious::Controller]]の C<stash>とC<param>を通して利用できます。

source: Route placeholders allow capturing parts of a request path until a C</> or C<.> separator occurs, similar to the regular expression C<([^/.]+)>.
ja: ルーティング(routes)プレースホルダを使用すると、区切り文字である/あるいは.が出現するまでの、 リクエストパスの一部分をキャプチャすることができます。

source: Routes are basically just fancy paths that can contain different kinds of placeholders and usually lead to an action, if they match the path part of the request URL.
ja: ルーティング(routes)は一般的にいうと異なる種類のプレースホルダを含むことのできる仮想的なパスです。

source: See L<Mojolicious::Guides> for more!
ja: 詳しくは L<Mojolicious::Guides> を見てください！

source: Similar to templates, but with only a single file extension and optional Base64 encoding, static files can be inlined in the C<DATA> section and are served automatically.
ja: テンプレートと似ていますが、単一の拡張子とBase64エンコーディングに限られますが、静的ファイルはC<DATA>セクションの中に、インラインで記述することができます。

source: Some of the most commonly used tools are L<Mojo::UserAgent>, L<Mojo::DOM>, L<Mojo::JSON>, L<Mojo::Server::Daemon>, L<Mojo::Server::Prefork>, L<Mojo::IOLoop> and L<Mojo::Template>.
ja: このうちもっともよく使われているツールには以下があります。 L<Mojo::UserAgent>, L<Mojo::DOM>, L<Mojo::JSON>, L<Mojo::Server::Daemon>, L<Mojo::Server::Prefork>, L<Mojo::IOLoop> and L<Mojo::Template>

source: Template blocks can be used like normal Perl functions and are always delimited by the C<begin> and C<end> keywords, they are the foundation for many helpers.
ja: テンプレートブロックはPerlスクリプトにおける関数のように利用され、いつもC<begin>とC<end>というキーワードで区分されています。これらは、多くのヘルパーの基盤です。

source: Templates can have layouts too, you just select one with the helper L<Mojolicious::Plugin::DefaultHelpers/"layout"> and place the result of the current template with the helper L<Mojolicious::Plugin::DefaultHelpers/"content">.
ja: テンプレートはレイアウトを持つことができます。[[Mojolicious::Plugin::DefaultHelpers]] のC<layout>ヘルパーを使って、 レイアウトの一つを選択することができ、 [[Mojolicious::Plugin::DefaultHelpers]]のC<content> ヘルパーを使って、現在のテンプレートの結果を置換できます。

source: Testing your application is as easy as creating a C<t> directory and filling it with normal Perl tests like C<t/basic.t>, which can be a lot of fun thanks to L<Test::Mojo>.
ja: C<t>ディレクトリを作成して 普通のPerlの単体テストを書くだけです。[[Test::Mojo]]のおかげで、 とても楽しいです。

source: The L<Mojolicious::Controller/"stash"> is used to pass data to templates, which can be inlined in the C<DATA> section.
ja: [[Mojolicious::Controller]]のC<stash>はデータをテンプレートに渡すために利用されます。

source: The default operating mode will usually be C<development> and can be changed with command line options or the C<MOJO_MODE> and C<PLACK_ENV> environment variables.
ja: デフォルトの処理モードは通常はC<development>ですが、コマンドラインオプションかC<MOJO_MODE>あるいはC<PLACK_ENV>環境変数で変更することもできます。

source: The first argument passed to all actions (C<$c>) is a L<Mojolicious::Controller> object, containing both the HTTP request and response.
ja: すべてのアクション（C<$self>）に渡される第一引数は、HTTPリクエストとレスポンスを含んでいる[[Mojolicious::Controller]]のインスタンスです。

source: The stash or helpers like L<Mojolicious::Plugin::DefaultHelpers/"title"> can be used to pass additional data to the layout.
ja: スタッシュや[[Mojolicious::Plugin::DefaultHelpers]]のC<title>のようなヘルパー/"title"> は追加的なデータをレイアウトに渡すために利用されます。

source: This is only the first of the L<Mojolicious::Guides>.
ja: これはL<Mojolicious::Guides>の最初の部分です。

source: WebSocket applications have never been this simple before.
ja: WebSocketアプリケーションはこれまでに見たこともないくらい簡単です。

source: Wildcard placeholders allow matching absolutely everything, including C</> and C<.>, similar to the regular expression C<(.+)>.
ja: ワイルドカードプレースホルダを使用するとC</>を含むすべてにマッチさせることができます。

source: With L<Mojo::UserAgent>, which is available through the helper L<Mojolicious::Plugin::DefaultHelpers/"ua">, there's a full featured HTTP and WebSocket user agent built right in.
ja: [[Mojo::UserAgent]]は、完全に機能を備えたHTTP 1.1とWebSocketの組み込みのユーザーエージェントです。[[Mojolicious::Plugin::DefaultHelpers]]のC<ua>を通して利用できます。

source: With L<Mojolicious::Command::Author::generate::lite_app> there is also a helper command to generate a small example application.
ja: L<Mojolicious::Command::Author::generate::lite_app> では、小さなアプリケーションサンプルを生成するためのヘルパーコマンドもあります。

source: You can also group related routes with L<Mojolicious::Lite/"group">, which allows nesting of routes generated with L<Mojolicious::Lite/"under">.
ja: 関連したルーティングをグループ化(C<group>)することもできます。ネストされた複数のC<under>を可能にします。

source: You can even use CSS selectors with L<Mojolicious::Command::get> to extract only the information you're actually interested in.
ja: 実際に興味がある情報だけを取り出すために、[[Mojolicious::Command::get]] を使って必要な情報だけを取り出すこともできます。

source: You can send JSON documents from the command line with L<Mojolicious::Command::get>.
ja: コマンドラインでL<Mojolicious::Command::get>を使ってJSONドキュメントを送信できます。

source: You can take a closer look at all the generated regular expressions with the command L<Mojolicious::Command::routes>.
ja: すべての生成された正規表現を見るのに、 [[Mojolicious::Command::routes]]を使うことができます。

source: You can test the more advanced examples right from the command line with L<Mojolicious::Command::get>.
ja: [[Mojolicious::Command::get]]を使って、 コマンドラインからより発展的なサンプルをすぐにテストすることができます。

source: Your application will automatically reload itself if you start it with the L<morbo> development web server, so you don't have to restart the server after every change.
ja: 開発用のサーバーであるC<morbo>でアプリケーションを起動すれば、 アプリケーションは自動的にリロードされます。毎回のソースコードの変更の後にサーバを再起動させる必要はありません。

source: helper whois => sub {
ja: my $self = shift;

source: if $c->req->is_limit_exceeded;
ja: if $self->req->is_limit_exceeded;

source: if $c->stash('format') eq 'json';
ja: if $self->stash('format') eq 'json';

source: my $bar = $c->param('bar');
ja: my $bar = $self->param('bar');

source: my $bar = $c->stash('bar');
ja: my $bar = $self->stash('bar');

source: my $c = shift;
ja: my $self = shift;

source: my $foo = $c->param('foo');
ja: my $foo = $self->param('foo');

source: my $host = $c->req->url->to_abs->host;
ja: my $host = $self->req->url->to_abs->host;

source: my $ip = $c->tx->remote_address;
ja: my $ip = $self->tx->remote_address;

source: my $method = $c->req->method;
ja: my $method = $self->req->method;
